netgear/wndr3700v4/soaprequest_browse.xml

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
<s:Body>
	<ns0:Browse xmlns:ns0="urn:schemas-upnp-org:service:ContentDirectory:1">
		<ObjectID>OVERFLOW_ID</ObjectID>
		<BrowseFlag>BrowseDirectChildren</BrowseFlag>
		<Filter>*</Filter>
		<StartingIndex>0</StartingIndex>
		<RequestedCount>100</RequestedCount>
		<SortCriteria />
	</ns0:Browse>
</s:Body>
</s:Envelope>
